[{"CLASS": "AJ-101 Administration of Justice", "HOURS": "54.00 hrs lecture", "UNITS": "Units: 3.00", "MISC": " Advisory: ENGL-101A Accepted For Credit: CSU & UC This course covers the history and philosophy of administration of justice in America as well as describing the justice system itself and describing relationships of its various subsystems. The course also explores theories of crime, punishment, ethics, education, and training for professionalism in the justice system. (GR) C-ID AJ 110"}, {"CLASS": "AJ-102 Criminal Law", "HOURS": "54.00 hrs lecture", "UNITS": "Units: 3.00", "MISC": " Advisory: Eligible for ENGL-151B and ENGL-163 Accepted For Credit: CSU & UC This course covers concepts of criminal law: historical development, philosophy of law, and constitutional provisions. The course also covers classifications of crime and their application to justice, case law, methodology, and concepts of the law as a social force. (GR) C-ID AJ 120"}, {"CLASS": "AJ-104 Criminal Evidence", "HOURS": "54.00 hrs lecture", "UNITS": "Units: 3.00", "MISC": " Advisory: ENGL-101A Accepted For Credit: CSU This course covers the legal aspects of evidence: the origin, development, philosophy, and constitutional basis of evidence, along with constitutional and procedural considerations affecting arrest, search, and seizure; kinds and degrees of evidence; and rules governing admissibility. This course uses judicial decisions interpreting individual rights, plus case studies, to analyze the material presented. (GR) C-ID AJ 124"}, {"CLASS": "AJ-106 Criminal Procedure", "HOURS": "54.00 hrs lecture", "UNITS": "Units: 3.00", "MISC": " Advisory: ENGL-101A Accepted For Credit: CSU This course covers the principles and procedures of the justice system. The course is an in-depth study of the role and responsibilities of each segment within the Administration of Justice system—law enforcement, judicial, and corrections. (GR)"}, {"CLASS": "AJ-107 Criminal Investigation", "HOURS": "54.00 hrs lecture", "UNITS": "Units: 3.00", "MISC": " Advisory: Eligible for ENGL-101A Accepted For Credit: CSU This course covers the nature of investigation; crime scene search and recording; interviews and interrogation; sources of information; case preparation; and investigative techniques in specific crimes. (GR) C-ID AJ 140"}, {"CLASS": "AJ-108 Introduction to Forensic Anthropology", "HOURS": "54.00 hrs lecture", "UNITS": "Units: 3.00", "MISC": " Cross-referenced Course: ANTH-108 Accepted For Credit: CSU & UC This course introduces the field of forensic anthropology through a study of the history and methods of forensic anthropology and the role it plays in the medico-legal system. Topics include the human skeletal system, forensic archaeology, recovery, and techniques for analyzing human skeletal remains. (GC) AJ-117 Police and Society 54.00 hrs lecture Units: 3.00 Advisory: ENGL-101A Accepted For Credit: CSU This course involves an in-depth exploration of the roles of AJ practitioners and their agencies. Through interaction and study the student will become aware of interrelationships and role expectations among various agencies and the public. Emphasis is placed on professional image of Administration of Justice system and development of positive relationships between members of the system and the public. (GR) C-ID AJ 160"}, {"CLASS": "AJ-117 Police and Society", "HOURS": "54.00 hrs lecture", "UNITS": "Units: 3.00", "MISC": " Advisory: ENGL-101A Accepted For Credit: CSU This course involves an in-depth exploration of the roles of AJ practitioners and their agencies. Through interaction and study the student will become aware of interrelationships and role expectations among various agencies and the public. Emphasis is placed on professional image of Administration of Justice system and development of positive relationships between members of the system and the public. (GR) C-ID AJ 160"}, {"CLASS": "AJ-118 Criminology", "HOURS": "54.00 hrs lecture", "UNITS": "Units: 3.00", "MISC": " Advisory: ENGL-101A Accepted For Credit: CSU & UC This course studies human behavior and the reasons and motivations why people commit crimes. This course also examines the nature and extent of crimes as well as causes and prevention of criminality. (GR) C-ID SOCI 160"}, {"CLASS": "AJ-119 Murder in America", "HOURS": "54.00 hrs lecture", "UNITS": "Units: 3.00", "MISC": " Cross-referenced Course: PSY-104 Advisory: ENGL-101A Accepted For Credit: CSU This course surveys the psychological and criminological aspects of murder throughout America, emphasizing serial killers, mass murderers, spree killers, and foreign and domestic terrorists and their victims. (GR)"}, {"CLASS": "AJ-121 Constitutional Law and the United States", "HOURS": "54.00 hrs lecture", "UNITS": "Units: 3.00", "MISC": " Cross-referenced Course: PS-106 Advisory: Eligible for ENGL-101A Accepted For Credit: CSU This course examines the development of judicial review and the evolving role of the U.S. Supreme Court through analysis of landmark decisions of the Court. In particular, this course will focus on a theoretical discussion exploring the plurality of methods of constitutional interpretation used by justices in the past and present. (GC) AJ-123 Terrorism 54.00 hrs lecture Units: 3.00 Advisory: ENGL-101A Accepted For Credit: CSU This course examines basic information about the structure and nature of domestic and international terrorism, and the roles of state and local law enforcement in national defense. This course is designed for Administration of Justice majors and those interested in becoming a police officer or working within Homeland Security. (GR)"}, {"CLASS": "AJ-123 Terrorism", "HOURS": "54.00 hrs lecture", "UNITS": "Units: 3.00", "MISC": " Advisory: ENGL-101A Accepted For Credit: CSU This course examines basic information about the structure and nature of domestic and international terrorism, and the roles of state and local law enforcement in national defense. This course is designed for Administration of Justice majors and those interested in becoming a police officer or working within Homeland Security. (GR)"}, {"CLASS": "AJ-131 Administration of Juvenile Justice", "HOURS": "54.00 hrs lecture", "UNITS": "Units: 3.00", "MISC": " Advisory: Eligible for ENGL-101A Accepted For Credit: CSU This course covers the causes and forms of juvenile delinquency; the handling of juvenile offenders and victims; the prevention and repression of juvenile delinquency; the diagnosis and referral of juvenile offenders; the organization of community resources; and juvenile law and juvenile court procedures. (GR) C-ID AJ 220"}, {"CLASS": "AJ-220 Basic Police Academy", "HOURS": "180.00 hrs lecture, 693.00 hrs lab", "UNITS": "Units: 22.00", "MISC": " Prerequisite: POST approved pre-entry English skills scor of 48; physical abilities assessment examinations provide by the Academy with a score of 320 or greater; 1.5 mile ru in 14 minutes or less Advisory: Penal Code Section 13511.5 requires that eac applicant for admission to a basic course of training certifie by the Commission (including the P.C. 832 course) th includes the carrying and use of firearms, and who is n sponsored by a local or other law enforcement agency, or i not a peace officer employed by a state or local agenc department, or district, shall be required to submit writte certification from the Department of Justice that the applica has no criminal history background which would disqualif him or her from owning, possessing, or having under his her control a firearm. Medical clearance by a license physician and a valid driver’s license. PELLETB Written Exa with a score of 48. Physical Agility Exam provided by th Academy with a score of 320 or greater. This course satisfies all minimum required training mandat governed by the Commission on Peace Officer Standards an Training (POST) entry level Peace Officers. The course includ fundamental principles, procedures, and techniques of la enforcement, including criminal law, patrol procedure cultural diversity, investigative procedures, report writin defensive tactics, firearms, leadership, ethics, communit relations, police vehicles operations, traffic enforceme accident investigation, and first aid/CPR. This course is ope to those students who meet and satisfy entry requiremen including written examination, physical fitness examinatio DOJ fingerprint clearance, and medical clearance. This cours requires significant time commitments and outsid coursework including uniform preparation, homewor assignments, and equipment maintenance. (GR)"}, {"CLASS": "AJ-222 Interview and Interrogation", "HOURS": "9.00 hrs lecture, 18.00 hrs lab", "UNITS": "Units: 0.50", "MISC": " Prerequisite: Commission on Police Officer Standards an Training (POST) certified basic law enforcement academ diploma or equivalent as determined by the Dean of Academ Instruction. NOTE: Approval of equivalent training is not guarantee state regulatory or licensing agencies will als grant equivalency. Familiarity and ability to demonstrate a of the following skills: familiarity with victims of a crim victim interviews, people in custody; knowledge of crimin law. These skills will not be taught in the course; rath they will be the starting point for advanced officer trainin that builds upon them. This course provides students with a workable plan whe they enter interviews and interrogations. Topics includ indicators of deception; cognitive interviews; verbal an nonverbal communication; interview and interrogatio preparation; questioning dynamics; and interrogations. N applicable to associate degree. (CR)"}, {"CLASS": "AJ-222A1 Interview and Interrogation", "HOURS": "9.00 hrs lecture, 31.50 hrs lab", "UNITS": "Units: 1.00", "MISC": " Prerequisite: Commission on Police Officer Standards and Training (POST) certified basic law enforcement academy diploma or equivalent as determined by the Dean of Academy Instruction. NOTE: Approval of equivalent training is not a guarantee state regulatory or licensing agencies will also grant equivalency. Familiarity with and ability to demonstrate all of the following skills: familiarity with victims of a crime; victim interviews; people in custody; knowledge of criminal law. These skills will not be taught in the course; rather, they will be the starting point for advanced officer training that builds upon them. This course provides students with a workable plan when they enter interviews and interrogations. Topics include indicators of deception; cognitive interviews, verbal and nonverbal communication; interview and interrogation preparation; questioning dynamics; and interrogations. Not applicable to associate degree. (CR)"}, {"CLASS": "AJ-223 Canine Update", "HOURS": "18.00 hrs lecture, 108.00 hrs lab", "UNITS": "Units: 3.00", "MISC": " Prerequisite: POST certified basic law enforcement academy or equivalent as determined by the Dean of Academy Instruction. NOTE: Approval of equivalent training is not a guarantee state regulatory or licensing agencies will also grant equivalency. Familiarity with and ability to demonstrate the following minimum knowledge and skill levels: first aid; knowledge of K-9 equipment; knowledge of K-9 safety gear; knowledge of bite work commands; knowledge of case law related to K-9 deployment; officer safety. This course is designed to provide officer safety tactics, K-9 bite work, and building searches in a field environment, utilizing scenarios. The course provides updates on recent K-9 incidents and policies. Not applicable to associate degree. Repeatable = Unlimited times (CR)"}, {"CLASS": "AJ-227A135 Basic Police Academy Modular, Level I", "HOURS": "99.00 hrs lecture, 450.00 hrs lab", "UNITS": "Units: 13.50", "MISC": " Prerequisite: AJ-228A5, POST Basic Police Academy Modular II, or POST Basic Police Academy Modular Level III Advisory: POST entry reading and writing exam; Academy physical agility test This course is certified by the Commission on Peace Officer Standards and Training (POST) and meets the content and hour requirements established by POST for Level I Reserve Peace Officer. Not applicable to associate degree. (GR)"}, {"CLASS": "AJ-228A5 Basic Police Academy Modular Level II", "HOURS": "36.00 hrs lecture, 180.00 hrs lab", "UNITS": "Units: 5.00", "MISC": " This course satisfies California Peace Officers Standards and Training (POST) minimum training mandates for Basic Academy Modular, Level II. This course covers fundamental principles, procedures, and techniques of law enforcement including criminal law, patrol procedures, cultural diversity, investigative procedures, report writing, community relations, defensive tactics, and firearms. This course, combined with a Level III certificate, meets the POST requirements for a Level II Reserve Police Officer. The Level II certificate is a prerequisite for entering Level I. Students must complete all three levels of the Modular Format Academy to be equivalent to a Basic Police Academy certificate. (GR)"}, {"CLASS": "AJ-229A4 Basic Police Academy Modular, Level III", "HOURS": "36.00 hrs lecture, 126.00 hrs lab", "UNITS": "Units: 4.00", "MISC": " Prerequisite: Completion of the Academy application process (i.e. medical clearance, proof of medical insurance, DMV) and submission of DOJ Firearms clearance This course is certified by the Commission on Peace Officer Standards and Training (POST) and meets the content and hour requirements established by POST for Level III Reserve Peace Officers. Level III with Level II and Level I certificates meet the regular basic Academy requirements. (GR)"}, {"CLASS": "AJ-231 Police Continued Professional Training", "HOURS": "9.00 hrs lecture, 18.00 hrs lab", "UNITS": "Units: 0.50", "MISC": " Prerequisite: AJ-220 or POST Basic Police Academy Certificate. Commission on Police Officer Standards and Training (POST) certified basic law enforcement academy diploma or equivalent as determined by the Dean of Academy Instruction. NOTE: Approval of equivalent training is not a guarantee state regulatory or licensing agencies will also grant equivalency. Familiarity with and ability to demonstrate all of the following skills: familiarity with active shooters, use of force, firearms, patrol procedures, investigative report writing techniques, first aid, CPR, cultural diversity; knowledge of vehicle operations, defensive tactics techniques, lifetime fitness. This course provides agency discretionary training and/or required mandated training according to the Commission on Peace Officer Standards and Training (POST). Related topics include state/legislatively mandated training, tactical communication, officer safety, and legal updates. This course may be certified to meet continuing professional training standards prescribed by POST. Not applicable to associate degree. Repeatable = Unlimited times (CR)"}, {"CLASS": "AJ-235 Drug Investigation - 11550", "HOURS": "4.50 hrs lecture, 13.50 hrs lab", "UNITS": "Units: 0.50", "MISC": " Prerequisite: AJ-220 or Basic POST Certificate This course familiarizes students with the commonly abused controlled substances, methods of acquisition, and the signs and symptoms. Not applicable to associate degree. Repeatable = Unlimited times (CR)"}, {"CLASS": "AJ-237 Field Training Officer", "HOURS": "9.00 hrs lecture, 31.50 hrs lab", "UNITS": "Units: 1.00", "MISC": " Prerequisite: Commission on Police Officer Standards and Training (POST) certified basic law enforcement academy diploma or equivalent as determined by the Dean of Academy Instruction. Approval of equivalent training is not a guarantee state regulatory or licensing agencies will also grant equivalency. Familiarity and ability to demonstrate all of these skills and minimum knowledge: professionalism and ethics in policing; leadership in policing; sexual harassment policies This course is designed for students that have been or will be accepted into field training officer programs in law enforcement agencies. This course has certification from the California Commission on Peace Officer Standards and Training and follows the guidelines and standards under 832.3 of the Penal Code. Not applicable to associate degree. (CR)"}, {"CLASS": "AJ-240A Advanced Officer Training", "HOURS": "4.50 hrs lecture, 31.50 hrs lab", "UNITS": "Units: 0.50", "MISC": " Prerequisite: AJ-220 or POST Basic Police Academy Certificate. Commission on Police Officer Standards and Training (POST) certified basic law enforcement academy diploma or equivalent as determined by the Dean of Academy Instruction. Approval of equivalent training is not a guarantee state regulatory or licensing agencies will also grant equivalency. Familiarity with and ability to demonstrate the following skills: familiarity with active shooters; use of force; firearms; patrol procedures; investigative report writing techniques; first aid and CPR; cultural diversity; knowledge of vehicle operations; defensive tactics techniques; lifetime fitness. These skills and abilities will not be taught in the course; rather, they will be the starting point for advanced officer training that builds upon them. This course provides agency discretionary training and/or required mandated training according to the Commission on Peace Officer Standards and Training (POST), Correction Standards Authority (CSA), State Fire Training (SFT), or other regulatory agency. Related topics include state/legislatively mandated training, perishable skills, first aid/CPR, officer safety, legal updates, and cultural awareness. This course may be certified to meet continuing professional training standards prescribed by POST, CSA, SFT, or other regulatory agency where appropriate. Not applicable to associate degree. Repeatable = Unlimited times (CR)"}, {"CLASS": "AJ-240A1 Advanced Officer Training", "HOURS": "9.00 hrs lecture, 36.00 hrs lab", "UNITS": "Units: 1.00", "MISC": " Prerequisite: Commission on Police Officer Standards and Training (POST) certified basic law enforcement academy diploma or equivalent as determined by the Dean of Academy Instruction. Familiarity with and ability to demonstrate all of these skills and minimum knowledge: Officer safety; proper and safe firearms handling; proper and safe firearms storage; proper and safe firearms cleaning techniques; achieve a qualifying score during tactical handgun shooting; achieve a qualifying score during shotgun shooting; proper and safe tactical movement; proper and safe arrest and control technique; proper and safe ground fighting technique; proper and safe handling and use of chemical weapons; proper and safe handling and use of nonlethal weapons; Penal codes used in policing; Vehicle codes used in policing; Health and Safety codes used in policing This course provides agency discretionary training and/or required mandated training according to the Commission on Peace Officer Standards and Training (POST), Correction Standards Authority (CSA), State Fire Training (SFT), or other regulatory agency. Related topics include state/legislatively mandated training, perishable skills, first aid/CPR, officer safety, legal updates, and cultural awareness. This course may be certified to meet continuing professional training standards prescribed by POST, CSA, SFT, or other regulatory agency where appropriate. Not applicable to associate degree. Repeatable = Unlimited times (CR)"}, {"CLASS": "AJ-242 Police Supervisor", "HOURS": "18.00 hrs lecture, 63.00 hrs lab", "UNITS": "Units: 2.00", "MISC": " Prerequisite: AJ-220 or Basic POST Certificate This course emphasizes the basic elements of supervision an how they may be applied to police work. Essentials of goo leadership and understanding of the basic needs of huma beings as well as ways to stimulate subordinates to bett performance are the contents of the course. Not applicabl to associate degree. Repeatable = Unlimited times (GR)"}, {"CLASS": "AJ-243A5 Law Enforcement Seminar", "HOURS": "9.00 hrs lecture, 18.00 hrs lab", "UNITS": "Units: 0.50", "MISC": " Prerequisite: Commission on Police Officer Standards an Training (POST) certified basic law enforcement academ diploma or equivalent as determined by the Dean of Academ Instruction. NOTE: Approval of equivalent training is not guarantee state regulatory or licensing agencies will als grant equivalency. Familiarity with and ability to demonstrat the following minimum knowledge and skill levels: offic safety; investigation process; Americans with Disabilities A verbal communication used in policing; report writin elements required to arrest for sex crimes Topics discussed in this course include a review of th Americans with Disabilities Act; protecting the rights people with disabilities; responding to sexual assau and interviewing victims; completing a death scen investigation; and the structure and training of Reserv Officers. Not applicable to associate degree. Repeatable Unlimited times (CR)"}, {"CLASS": "AJ-245 Citizen’s Police Academy", "HOURS": "9.00 hrs lecture, 18.00 hrs lab", "UNITS": "Units: 0.50", "MISC": " The purpose of the Citizen’s Police Academy is to enhanc the relationship of the Police Department with th community by educating the citizen in various aspects police operations. The citizen becomes more aware of wh services the Police Department can and, in some situation can’t provide; the methodologies and strategies behind th Police Department’s programs and tactics; as well as oth important aspects of law enforcement, not only on neighborhood level but also on a wider scale. Not applicabl to associate degree. Repeatable = Unlimited times (CR)"}, {"CLASS": "AJ-245A1 Citizen Police Academy", "HOURS": "50.00 hrs lecture", "UNITS": "Units: 1.00", "MISC": " The purpose of the Citizen Police Academy is to enhanc the relationship of the Police Department with th community by educating the citizen in various aspects police operations. The citizen becomes more aware of wh services the Police Department can and—in some situations can’t provide; the methodologies and strategies behind it programs and tactics; as well as other important aspects law enforcement, not only on a neighborhood level but als on a wider scale. Not applicable to associate degre Repeatable = Unlimited times (CR)"}, {"CLASS": "AJ-246A6 Law Enforcement Field Training Program", "HOURS": "450.00 hrs lab", "UNITS": "Units: 6.00", "MISC": " Prerequisite: Commission on Police Officer Standards and Training (POST) certified basic law enforcement academy diploma or equivalent as determined by the Dean of Academy Instruction. Familiarity with officer safety; proper and safe firearms handling, firearms storage, firearms cleaning techniques; Penal codes used in policing; Vehicle codes used in policing; Health and Safety codes used in policing; Welfare and Institutions codes used in policing; effective verbal communication used in policing; effective non-verbal communication used in policing; case law pertinent to policing; proper CPR technique; proper first aid technique; safe ground fighting technique; handling and use of chemical weapons; handling and use of non-lethal weapons. Ability to achieve a qualifying score during tactical handgun shooting; proper and safe arrest and control technique. This work experience course is designed to certify the completion of specifications described in the “Field Training Officer Guide” from the Commission on Peace Officer Standards and Training. Students are assigned in a patrol car, one-on-one with a certified Field Training Officer. The Field Training Program introduces a newly assigned officer to the personnel procedures, policies, and purposes of the individual law enforcement agency and provides the initial formal and informal training specific to the agency and the day-to-day duties of its officers. Not applicable to associate degree. Repeatable = Unlimited times (GR)"}, {"CLASS": "AJ-246A65 Law Enforcement Field Training Program", "HOURS": "520.00 hrs lab", "UNITS": "Units: 6.50", "MISC": " Prerequisite: POST certified as a California Peace Officer This course is part of a program certified to law enforcement agencies in the state of California. The program is designed to certify the completion of specifications described in the Field Training Officer Guide from the Commission on Peace Officer Standards and Training. Students will be assigned in a patrol car, one-on-one with a certified Field Training Officer. The Field Training Program introduces a newly assigned officer to the personnel procedures, policies, and purposes of the individual law enforcement agency, and provides the initial formal and informal training specific to the agency, and the day-to-day duties of its officers. Not applicable to associate degree. Repeatable = Unlimited times (GR)"}, {"CLASS": "AJ-246A8 Law Enforcement Field Training Program", "HOURS": "640.00 hrs lab", "UNITS": "Units: 8.00", "MISC": " Prerequisite: POST certified as a California Peace Officer This course is certified to law enforcement agencies in the state of California. The program is designed to certify the completion of specifications described in the Field Training Officer Guide from the Commission on Peace Officer Standards and Training. Students will be assigned in a patrol car, one-on-one with a certified Field Training Officer. The Field Training Program introduces a newly assigned officer to the personnel procedures, policies, and purposes of the individual law enforcement agency, and provides the initial formal and informal training specific to the agency, and the day-to-day duties of its officers. Not applicable to associate degree. Repeatable = Unlimited times (GR)"}, {"CLASS": "AJ-246A85 Law Enforcement Field Training Program", "HOURS": "680.00 hrs lab", "UNITS": "Units: 8.50", "MISC": " Prerequisite: POST certified as a California Peace Officer This course is certified to law enforcement agencies in the state of California. The program is designed to certify the completion of specifications described in the Field Training Officer Guide from the Commission on Peace Officer Standards and Training. Students will be assigned in a patrol car, one-on-one with a certified Field Training Officer. The Field Training Program introduces a newly assigned officer to the personnel procedures, policies, and purposes of the individual law enforcement agency, and provides the initial formal and informal training specific to the agency, and the day-to-day duties of its officers. Not applicable to associate degree. Repeatable = Unlimited times (GR)"}, {"CLASS": "AJ-246A9 Law Enforcement Field Training Program", "HOURS": "720.00 hrs lab", "UNITS": "Units: 9.00", "MISC": " Prerequisite: POST certified as a California Peace Officer This course is certified to law enforcement agencies in the state of California. The program is designed to certify the completion of specifications described in the Field Training Officer Guide from the Commission on Peace Officer Standards and Training. Students will be assigned in a patrol car, one-on-one with a certified Field Training Officer. The Field Training Program introduces a newly assigned officer to the personnel procedures, policies, and purposes of the individual law enforcement agency, and provides the initial formal and informal training specific to the agency, and the day-to-day duties of its officers. Not applicable to associate degree. Repeatable = Unlimited times (GR)"}, {"CLASS": "AJ-246A10 Law Enforcement Field Training Program", "HOURS": "750.60 hrs lab", "UNITS": "Units: 10.00", "MISC": " Prerequisite: POST certified as a California Peace Officer This is a work experience course designed to assist newly assigned peace officers with making the transition from the academy to competent performance of patrol duties. The Field Training Program introduces a newly assigned officer to the personnel procedures, policies, and purposes of the individual law enforcement agency and the day-to-day duties of its officers. Not applicable to associate degree. (CR)"}, {"CLASS": "AJ-247 Field Training Officer Update", "HOURS": "9.00 hrs lecture, 13.50 hrs lab", "UNITS": "Units: 0.50", "MISC": " Prerequisite: Field Training Officers employed with a law enforcement agency This course is designed to update Field Training Officers in evaluations, legal aspects, and changes to the Commission of Peace Officer Standards and Training. Not applicable to associate degree. Repeatable = 3 times (CR)"}, {"CLASS": "AJ-248 Instructor Development", "HOURS": "9.00 hrs lecture, 36.00 hrs lab", "UNITS": "Units: 1.00", "MISC": " Prerequisite: AJ-220 or Basic POST Certificate This POST-certified course is designed to provide instruction for POST Academy instructors in adult learning principles including instructional planning skills, presentation, and facilitation techniques. Not applicable to associate degree. (CR)"}]